[{"body":"This year, the world lost many notable people Maya Angelou, Robin Williams and Bob Hoskins, to name a few. Then there were deaths that didnt make headlines but deeply affected us. Parents, children, siblings, friends, mentors. Did you lose someone this year? We invite you to share a story about the person and tell us why they were so special to you, along with a photo of the departed. See them featured at http://cnn.it/lost2014. Submitting from a mobile device? Please use the CNN app or email ireport@cnn.com to upload to this assignment.","title":"Those we lost in 2014: News & Videos about Those we lost in 2014","url":"http://ireport.cnn.com/topics/1196713","image_url":"http://i.cdn.turner.com/ireport/sm/prod/2014/12/11/WE01172140/3461836/candlesgettystorytopjpg-3461836_md.jpg"},{"body":"Any idea what \"IWSN\" stands for in Internet slang? It's a declarative statement: I want sex now. If it makes you feel any better, I had no clue, and neither did a number of women I asked about it. Acronyms are widely popular across the Internet, especially on social media and texting apps, because, in some cases, they offer a shorthand for communication that is meant to be instant. READ: Chances are, your teen has sexted So \"LMK\" -- let me know -- and \"WYCM\" -- will you call me? -- are innocent enough. But the issue, especially for parents, is understanding the slang that could signal some dangerous teen behavior, such as \"GNOC,'\" which means \"get naked on camera.\" And it certainly helps for a parent to know that \"PIR\" means parent in room, which could mean the teen wants to have a conversation about things that his or her mom and dad might not approve of. Katie Greer is a national Internet safety expert who has provided Internet and technology safety training to schools, law enforcement agencies and community organizations throughout the country for more than seven years. She says research shows that a majority of teens believe that their parents are starting to keep tabs on their online and social media lives. \"With that, acronyms can be used by kids to hide certain parts of their conversations from attentive parents,\" Greer said. \"Acronyms used for this purpose could potentially raise some red flags for parents.\" READ: 10 signs you might be addicted to your smartphone But parents would drive themselves crazy, she said, if they tried to decode every text, email and post they see their teen sending or receiving. \"I've seen some before and it's like 'The Da Vinci Code,' where only the kids hold the true meanings (and most of the time they're fairly innocuous),\" she said. Still, if parents come across any acronyms they believe could be problematic, they should talk with their kids about them, said Greer. But how, on earth, is a parent to keep up with all these acronyms, especially since new ones are being introduced every day? \"It's a lot to keep track of,\" Greer said. Parents can always do a Google search if they stumble upon an phrase they aren't familiar with, but the other option is asking their children, since these phrases can have different meanings for different people. \"Asking kids not only gives you great information, but it shows that you're paying attention and sparks the conversation around their online behaviors, which is imperative.\" Micky Morrison, a mom of two in Islamorada, Florida, says she finds Internet acronyms \"baffling, annoying and hilarious at the same time.\" She's none too pleased that acronyms like \"LOL\" and \"OMG\" are being adopted into conversation, and already told her 12-year-old son -- whom she jokingly calls \"deprived,\" since he does not have a phone yet -- that acronym talk is not allowed in her presence. But the issue really came to a head when her son and his adolescent friends got together and were all \"ignoring one another with noses in their phones,\" said Morrison, founder of BabyWeightTV. \"I announced my invention of a new acronym: 'PYFPD.' Put your freaking phone down.\" But back to the serious issue at hand, below are 28 Internet acronyms, which I learned from Greer and other parents I talked with, as well as from sites such as NoSlang.com and NetLingo.com, and from Cool Mom Tech's 99 acronyms and phrases that every parent should know. After you read this list, you'll likely start looking at your teen's texts in a whole new way. 5 CU46 - See you for sex 10. THOT - That hoe over there 27. GYPO - Get your pants off Know any other Internet acronyms parents should learn about? Tell Kelly Wallace on Twitter or CNN Living on Facebook.","title":"28 Internet acronyms every parent should know","url":"http://edition.cnn.com/2014/12/08/living/internet-acronyms-every-parent-should-know/index.html","image_url":"http://i2.cdn.turner.com/cnnnext/dam/assets/120917094511-eveexp-decoding-sexting-terms-00004710-t3-entertainment.jpg"},{"body":"Dennis Rodman belted out \"Happy Birthday\" -- not far from Marilyn Monroe's rendition -- as the Pyongyang crowd clapped in unison during a basketball game. This year's birthday affairs are less likely to be bizarre -- Rodman is not in town. Kim's birthday is believed to fall on January 8, but like most affairs of North Korea, his personal details are opaque. North Korean state media has not acknowledged the exact date of Kim's birth in either of its Korean and English-language archives. \"There is a lot of debate about the year he was born,\" said Cheong Seong-chang, a senior research fellow at the Sejong Institute, a Korean think tank. \"Some say it is 1984 while others say is '83 or '82.\" In previous years, Kim has distributed sweets to children on January 7 which was a tradition held by his grandfather and father during their birthdays. The birthday of Kim Il Sung, the founder of the country, is considered the Day of the Sun and falls on April 15. Kim Jong Il's birthday, on February 16, is known as the Day of the Shining Star. These are the days when residents received goods from the state and children got sweets. The days are marked with pomp and circumstance, including military parades, patriotic chants and oaths of loyalty to the leaders. But the current leader Kim's birthday has been decidedly more low-key during his three years in power. \"There's a lot of speculation why that's the case,\" said Lee Jung Hoon, professor of international relations at Yonsei University in South Korea. \"Kim could be trying to put out this image as a humble guy, that he's not extravagant. Then there's sort of negative take on this issue, as to he's still very young, 29, 30 or 31. When you start marking his birthday, then the whole North Korean people will start to wonder, then what's his age?\" And revealing his age raises questions about experience. \"It could be because he is a young leader. Being young could have its advantage and disadvantage, but it appears as though he doesn't want to make it public yet,\" said Cheong. Unlike his predecessors, there's little sign that Kim's birthday is a major national holiday. The Kyodo News reported last year that the current North Korean leader's birthday is not likely to be celebrated as a national holiday this year, after it reviewed five North Korean calendars for 2015. And North Korean workers at the joint Kaesong Industrial Complex never have asked for a holiday on January 8 in the past two years, according to the South Korean Unification Ministry, the agency which handles North Korean affairs. His birth date was first revealed by Kenji Fujimoto, the former sushi chef of Kim's father, Kim Jong Il. \"The date is known as accurate, but North Korea never officially confirmed it,\" said Cheong. The Unification Ministry recorded Kim's birthday as January 8, although the exact year of birth is marked as 1982, 1983 or 1984. In Kim's three years in power, he's largely followed the legacies of his father and grandfather, said Lee. A South Korean report that released this week indicated that North Korea could be closer to miniaturizing a nuclear warhead indicating that Kim has continued with the focus on nuclear weapons. And his regime has also been marked by the purge of Kim's uncle, Jang Song Thaek, who was executed after being branded a traitor in December 2013. \"Unfortunately, there were some hopes because he was educated in Switzerland and that he's young, people hoped that there might be some change. None of that has happened. It might be worse, because he's less experienced than his father and grandfather, and very rash and impatient as we've seen with the cyberattacks,\" Lee said, referring to a Sony hacking scandal in which the FBI blamed North Korea.","title":"In North Korea, even Kim Jong Un's birthday is an enigma","url":"http://edition.cnn.com/2015/01/07/asia/kim-jong-un-birthday/index.html","image_url":"http://i2.cdn.turner.com/cnnnext/dam/assets/141110204938-kim-jong-un-t3-entertainment.png"},{"body":"9to5Mac reports that Apple is testing a new 12-inch MacBook Air that is significantly thinner and even narrower than the current 11-inch model. To get a laptop that thin, Apple (AAPL, Tech30) swapped out all of the MacBook's ports for a single all-in-one miracle port. Today, MacBook Airs come with a USB port and a MagSafe charging port (and a headphone port -- that's staying). The ports are only a few millimeters thick, basically taking up the entire width of the laptop. If Apple does make the decision to switch to so-called USB Type C technology, it will be adopting a new, much thinner kind of USB plug that basically does everything. Type-C USB is capable of powering a computer, so users won't need a separate MagSafe charger. It can power a display, and it's significantly faster than \"old school\" USB technology -- fast enough to replace Apple's Thunderbolt ports. Best of all, Type-C USB plugs are reversible. That means no more struggling to figure out which way the plug is supposed to go. Related: This is the new USB connector - and it's reversible! And it's tiny technology. The plugs are roughly the size of today's micro-USB plugs that power just about every non-Apple smartphone. They're slightly larger than Apple's Lightning port. If Apple includes Type-C USB in its new MacBooks, which are expected to go on sale in the late spring, it could be just the jolt the new technology needs. The brand new Type-C USB technology started hitting stores late last year, but they haven't been widely adopted. There has been no shortage of interest in a reversible USB solution since Apple introduced its reversible Lightning connector for the iPhone and iPad in 2012. But many governments, including the European Union, have mandated micro-USB as the standard for charging and connecting. The oddly shaped micro-USB connector is slightly fatter on one side than the other, and it isn't as powerful or fast as USB Type C. Of course, having just one port comes with some disadvantages. That means you wouldn't be able to connect to a display or printer while charging your MacBook. It also means that you'll have to buy adapters for all your suddenly incompatible old-style USB plugs. An Apple spokesman could not be reached for comment. 9to5Mac reports that the new 12-inch MacBook that Apple is testing has a slightly smaller keyboard to create a narrower profile for the computer. But that doesn't necessarily mean that MacBook version will be the one to hit store shelves. Apple tests many models of its products before choosing which to sell to customers.","title":"Apple testing new super-thin MacBook Air","url":"http://money.cnn.com/2015/01/07/technology/macbook-air-usb/index.html","image_url":"http://i2.cdn.turner.com/money/dam/assets/150107090052-macbook-air-usb-620xa.png"},{"body":"Follow us at @WorldSportCNN and like us on Facebook After days of speculation, Oldham Athletic confirmed Thursday it wouldn't be handing a deal to Ched Evans, who was released from prison in October after serving half of a five-year sentence for raping a 19-year-old girl. The third-tier outfit said \"vile and abusive threats\" as well as \"significant financial pressure\" placed on the club from sponsors had prompted it to backtrack on the deal. Oldham's owner, Simon Corney, had previously said there was 80% chance it would hire Evans as it appeared undeterred by condemnation from fans, politicians and the police. Evans -- who insists he is innocent and is appealing against his conviction -- released his own statement Thursday, apologizing \"for the effects that night in Rhyl has had on many people, not least the woman concerned.\" And after Oldham's snub there are serious question marks as to whether any club will offer him a route back into the game. \"The whole issue has divided opinion and the club has been put under unbearable pressure as a result,\" read a statement on Oldham's official website. \"Proceeding could have placed significant financial pressure on the club and continued to be a divisive influence. As a consequence the deal could not go ahead. \"As a club we condemn all crime including rape and irrespective of any appeal procedure it was always the case that we were prepared to withstand the barrage of abuse that is evident within the country and on social media. \"We deplore and condemn the vile and abusive threats, some including death threats, which have been made to our fans, sponsors and staff whilst this process has been in the public domain.\" Despite Oldham's claims, Greater Manchester Police said nothing more than \"low level abuse\" had been reported to them when contacted by CNN. Oldham's climbdown represents the latest setback for Evans, who has been trying to resurrect his career since leaving jail in October. Evans started out at current English Premier League champion Manchester City, before joining Sheffield United in 2009. Upon his release from prison, the club's plan to allow Evans to train with them provoked a public backlash, with 160,000 people signing a petition against the move. A proposed deal with Hartlepool was also dropped following a similar outcry, the town's Labour MP calling Evans a \"pariah.\" And when a potential move to Maltese club Hibernians was mooted, the UK government's Ministry of Justice said its conditions for monitoring sex offenders effectively ruled out working abroad. Prior to confirmation the deal was off Evans released his own statement through the Professional Footballers Association, in which he apologized for the effect the case has had on his victim's life. \"Upon legal advice I was told not to discuss the events in question,\" he said. \"This silence has been misinterpreted as arrogance and I would like to state that this could not be further from the truth. \"I do remain limited at present by what I can say due to the ongoing referral to the Criminal Cases Review Commission, and whilst I continue to maintain my innocence I wish to make it clear that I wholeheartedly apologize for the effects that night in Rhyl has had on many people, not least the woman concerned. \"Finally it has been claimed that those using social media in an abusive and vindictive way towards this woman are supporters of mine. I wish to make it clear that these people are not my supporters and I condemn their actions entirely and will continue to do so.\" As an online petition protesting against Oldham acquiring Evans' signature joining nudged past 70,000 signatures, the town's council leader said the saga had created a culture of \"intimidation, abuse and harassment.\" \"The whole episode has divided the town and public opinion and there are no winners in all this -- not least of all the reputation of our club and town,\" Jim McMahon said. \"In recent days we've seen an horrendous 'trial by social media' with intimidation, abuse and harassment on a scale that has cast a terrible shadow. \"I am urging people on all sides of this debate to please now take stock, show some restraint and calm.\" \"I've always believed in rehabilitation but felt that both club and player should have allowed Mr Evans' appeal to run its course before agreeing a contract,\" McMahon added. \"As it stands Mr Evans has been found guilty in a court of law and has not yet completed his sentence. However, I take no pleasure in this outcome.\" The case has reached the highest level of British politics, with Prime Minister David Cameron repeatedly asked to comment on Evans' potential return to football. He said he \"understood\" the view of Olympic heptathlon champion Jessica Ennis-Hill after she told Sheffield United she wanted her name removed from one of the stands at its stadium should Evans play for it again. And Cameron waded into the controversy again on Thursday when he told LBC: \"My view is it is not for politicians to pick football teams, it should be for football clubs to pick their teams. \"But as they do that, they have to recognize that football players are role models for young people and they have to think about what will the impact be on the club, what will the impact be on young people. \"As for people who are in this position, surely the position is to recognize when you have done something wrong and you have been punished, rightly punished, you've got to work your way back. \"That might mean doing more voluntary work, putting more back in, in order to demonstrate to the public, the football-loving country we are, that you are really sorry about what happened and you want to atone for what you have done.\"","title":"Convicted rapist's search for soccer club goes on","url":"http://edition.cnn.com/2015/01/08/football/ched-evans-signs-oldham/index.html","image_url":"http://i2.cdn.turner.com/cnnnext/dam/assets/141017142848-chad-evans-tease-large-169.jpg"},{"body":"They had taken shelter from three armed men who had just opened fire against their colleagues during the weekly satirical newspaper's editorial committee. Events unfolded very rapidly from then on. French President Francois Hollande was very quick on the scene, the terrorist nature of the events was confirmed almost immediately and so was the shocking number of casualties: 12 dead and 11 injured, some critically. The operation appeared to have been prepared in a military style with weapons of war. What can cartoonists with their pen and paper do against killers with automatic weapons? Then the dead were given names, this is probably when the news really sank in. The cartoonists with the noms de plume Charb, Cabu, Wolinski and Tignous, known to millions in France, had been assassinated, at point blank range. Cabu and Wolinski, in particular, both in their late 70s, have accompanied generations of French people and made them laugh every week, in many different publications, on radio and on television, for over 50 years. I heard people unable to finish their sentences, forced to hang up the phone on learning the news -- too moved to speak. I saw shoppers stopping in their tracks, sinking lost onto benches, others in tears when learning the news from a friend's call. As U.S. Secretary John Kerry later commented, both in French and English, from Washington: France gave democracy to the world and knows better than most the price of Liberty. The French have been shockingly reminded that Liberte, Egalite, Fraternite -- values they fought hard to see every day on the frontispiece of their schools and public buildings -- are threatened by terrorists. While their identities have not yet been confirmed, France, with the largest Muslim community in the Western world (around 6 million out of a population of 66 million) has always been a prime target for Islamist extremists. In 1995, Paris reeled from a wave of terrorist attacks by the Algerian GIA, which killed a total of 12 people. In 1986, the Hezbollah had carried another deadly attack, bombing the grand magasin Tati, and killing 8 passers-by. French secret services were notoriously good at preventing such plots and President Hollande today revealed that many planned attacks had been very recently foiled. There will be a lot of soul searching in the next weeks and months within the French and President Hollande is facing difficult questions and an enormous task. With the far right of Marine Le Pen blowing the flames of national divisions and blaming immigration for France's many social and economic problems, and the left trying very hard not to stigmatize its Muslim citizens, there is little space left for a robust and calm public debate. The news that the French writer Michel Houellebecq, is now under police protection, as a result of today's attack on Charlie Hebdo, means that the French Interior ministry takes no chances with terrorism, but it also shows the depth of the malaise at the heart of French society. Houellebecq's latest novel takes place in 2022 during the presidential elections. After a second round between the far right and a French Islamist, the Islamists are rise to victory with the help of the liberal left -- and France is refounded as an Islamic State. Today, a French imam called the dead journalists and cartoonists of Charlie Hebdo \"martyrs of freedom.\" But France may have also discovered the price of its complacency and learned that such Fraternite should never be taken for granted. Charlie Hebdo: Satirical magazine is no stranger to controversy","title":"Charlie Hebdo terror: Why attack strikes France to core","url":"http://edition.cnn.com/2015/01/07/opinion/france-gunfire-poirier/index.html","image_url":"http://i2.cdn.turner.com/cnnnext/dam/assets/150107113629-charlie-hebdo-ambulance-large-169.jpg"},{"body":"In an essay published in the New York Review of Books on Thursday, Soros said the financial package is needed to help the Ukrainian government embark on radical economic reforms. The billionaire investor and philanthropist said while he supports the continuation of sanctions against Russia, the focus must be shifted from punishing Russia to helping Ukraine. \"Europe needs to wake up and recognize that it is under attack from Russia,\" wrote Soros. \"Assisting Ukraine should also be considered as a defense expenditure by the EU countries.\" The International Monetary Fund approved a $17 billion bailout for the distressed country in March. In the same month, the European Union offered Ukraine financial assistance worth about $15 billion in the form of loans, grants, investments and trade concessions. But as economic conditions deteriorate and Ukraine battles pro-Russian separatists in its eastern regions, the Ukraine government has said it will need more support. The IMF, which begins a new round of talks with Ukraine on its aid program this week, has estimated Ukraine will need another $15 billion to ease its financial troubles. This is not the first time Soros has spoken out about the need to support Ukraine. In March he said the country needed financial help on the scale of the Marshall Plan, which channeled billions of dollars in aid to western Europe after World War II. He also said help for Ukraine would have the indirect benefit of providing \"much-needed stimulus to the European economy by encouraging exports and investment in Ukraine.\" But Europe has been reticent to dig deeper into its coffers to support the conflict-hit country. Last month, the head of the European Commission Jean-Claude Juncker said Europe was limited in its capacity to help. \"There is only a small margin of flexibility for additional financing next year,\" he told the European parliament. \"If we fully use our margin for Ukraine, we will have nothing to address other needs that may arise over the next two years.\" Related: Europe will print money. It's just a matter of time","title":"Soros urges Europe to throw Ukraine $50 billion lifeline","url":"http://money.cnn.com/2015/01/08/news/soros-ukraine-europe-50-billion/index.html?iid=HP_LN","image_url":"http://i2.cdn.turner.com/money/dam/assets/150108104407-soros-ukraine-620xa.jpg"},{"body":"While there are all sorts of regulatory hurdles toward attaining that goal, Kennedy at least might have the dollars backing his vision. On Thursday he announced a \"multimillion dollar\" investment from well-known venture capitalist Peter Thiel's Founders Fund. Kennedy is chief executive of Privateer Holdings, a four year-old Seattle company with a small portfolio of marijuana businesses, including a lifestyle brand built around Bob Marley. \"Our goal is to be the world's premier company in the cannabis industry,\" Kennedy told CNN's Poppy Harlow. Kennedy hopes that a vote of confidence from a well-known Silicon Valley venture capitalist will help legitimize the marijuana industry and encourage other big investors to get involved. \"This is an important milestone in the financial world,\" he said. \"The next step is for politicians and bureaucrats to come in line with the rest of America.\" In addition to its \"Marley Natural\" brand of hemp products, Privateer owns a large medical marijuana grower in Canada and also Leafly, a marijuana website. The company currently does not sell marijuana in the United States, where it's illegal under federal law. Kennedy demurred when asked if Privateer was prepared to start selling in Colorado, Washington and other states where smoking pot for recreation has been legalized in the past year. \"It's increasingly becoming more viable in the United States and we're paying very close attention to that,\" he said. Kennedy said one of the biggest challenges facing the marijuana industry is marketing and branding. He wants to change the perception that selling pot is illicit as more states move towards legalization. \"This is a mainstream product, consumed by mainstream Americans,\" he said. Related: Bob Marley to sell marijuana from the grave","title":"Peter Thiel invests in pot start up","url":"http://money.cnn.com/2015/01/08/news/peter-thiel-marijuana-investment/index.html?iid=Lead","image_url":"http://i2.cdn.turner.com/money/dam/assets/150107171710-peter-theil-620xa.jpg"},{"body":"Sony's new ZX2 Walkman costs $1,119.99, and it plays music at a super-high resolution. That means songs on Sony's new Walkman sound more life-like than the typical CD, MP3 or streaming media file, which are compressed to fit into a smaller, downloadable package. Sony (SNE) says the new Walkman comes with audio technology that \"can reproduce master quality recordings just as the artists originally intended.\" The company also claims that the Walkman makes regular, non-high-resolution music files sound better. \"The new Walkman ZX2 is a great example of the quality of our high-res audio offerings,\" said Mike Fasulo, president of Sony Electronics USA, at the Consumer Electronics Show in Las Vegas. \"This Walkman is tailored for outstanding sound, and every piece of material and component has been crafted to realize the ultimate high-res audio experience on the move.\" For all its technical marvels, the new Walkman curiously runs \"Jelly Bean,\" a version of Android that came out in July 2013. New Android devices are running software that is two generations ahead of that. But the Walkman's 128 GB of storage is pretty spacious. Even though the music files are larger, that's enough space to hold just fewer than 2,000 songs. And it comes with a micro SD card slot for even more storage. It is Wi-Fi capable and has 60 hours of battery life. The Walkman ZX2 will be available this spring. It will go toe-to-toe with other high-resolution portable music offerings, including Neil Young's Pono player and music store. Rebranding the Walkman as a high-resolution media player is Sony's umpteenth attempt to resuscitate the iconic brand. The Walkman never went away, though it has faded from the spotlight. Over the past decade, Sony has released Walkman-branded headphones, MP3 players and phones. The original TPS-L2 Walkman debuted on July 1, 1979. The portable cassette player revolutionized how people listen to music. The Walkman wasn't the first of its kind, but it was the first affordable and manageable portable music player -- others like the German Stereobelt were too clunky and expensive, so they never took off. The Walkman continued to sell well even through the CD era. Innovations like the 1981 Walkman II -- barely bigger than a cassette tape -- and the 1984 Discman helped Sony stay on top of the portable music world. But sales began to plummet soon after Apple unveiled the iPod in 2001 and digital downloads began to dominate.","title":"This is Sony's new $1,120 Walkman","url":"http://money.cnn.com/2015/01/06/technology/innovationnation/sony-walkman-zx2/","image_url":"http://i2.cdn.turner.com/money/dam/assets/150106100517-sony-walkman-620xa.jpg"},{"body":"But The Washington Post did choose to show one of the images in Thursday's print edition. \"I think seeing the cover will help readers understand what this is all about,\" editorial page editor Fred Hiatt told The Post's Erik Wemple. Several popular news web sites have also published slide shows of Charlie Hebdo cartoons. Elsewhere, the news instinct to show the cartoons and express support for the slain journalists is countered by concerns about safety and sensitivity. Depictions of Mohammed are a strict taboo within Islam. It's brought forth a fierce debate among journalists. What some are calling sensitivity, others are calling censorship -- an acquiescence to terrorists. There has been widespread speculation that Wednesday's attack was motivated by the publication's criticism of religion. CNN, the owner of this web site, is among the news outlets that has verbally described Charlie Hebdo's cartoons but refrained from showing them. The network has made similar decisions about depictions of Mohammed in the past. In the network's daily editorial meeting on Thursday morning, CNN Worldwide president Jeff Zucker addressed the decision. \"Journalistically, every bone says we want to use and should use\" the cartoons, Zucker said. But \"as managers, protecting and taking care of the safety of our employees around the world is more important right now.\" On Wednesday, the Associated Press, the world's largest news gathering operation, said it has a \"longstanding policy\" to \"not move deliberately provocative images on the wire,\" according to a spokesman. This includes depictions of Mohammed. The New York Times, \"after careful consideration,\" also decided that \"describing the cartoons\" would suffice, according to a spokeswoman. NBC News said Wednesday that the network will not be showing \"headlines or cartoons that could be viewed as insensitive or offensive,\" and that guidance also applies to CNBC and MSNBC. Another major network, ABC News, has taken the same position. A CBS News executive, meanwhile, said the network had implemented no explicit ban on the Mohammed cartoons, but had instructed its producers to exercise judgment. Fox News told Mediaite it has \"no plans to air\" the Mohammed cartoons, but it did publish them in an online slideshow. News outlets have to consider that many Muslims take offense to cartoons like the ones published by Charlie Hebdo. This is particularly consequential for news organizations with bureaus in the Middle East. There have been sporadic incidents of violence against cartoonists and news outlets in the past. But in the aftermath of the attack, a number of popular news websites decided to show some of the French magazine's provocative covers, including a 2011 image of Mohammed. Among them: BuzzFeed, Business Insider, The Huffington Post, Gawker and The Daily Beast. On Wednesday morning, The Daily Beast updated a slide show it originally published in 2011, featuring 16 of the most \"shocking\" Charlie Hebdo covers. Daily Beast executive editor Noah Shachtman said there was \"zero hesitation\" to run the slide show. For one, he said, the images had inherent news value. But the decision to publish the covers was more than that: It was \"a show of solidarity.\" \"We're very much on the side of free expression everywhere. And especially in the face of this horrific attack, we want to show that we're with these brave editors, reporters and cartoonists,\" he said. Shachtman also assailed the Associated Press, calling the news wire \"gutless\" for not showing the cartoons that featured Mohammed. Gawker editor-in-chief Max Read detailed the magazine's history in a post that included the 2011 Mohammed cover, which is believed to have sparked an attack on the newspaper's offices on the day it was scheduled to come out. He said the decision was a no-brainer. \"We ran the cartoons because they're newsworthy,\" Read told CNNMoney. \"If we're going to discuss the controversial images that Charlie has published, we have a duty to our readers to show the images themselves (and to provide context to accompany them).\" \"Whatever solidarity we end up showing for Charlie is a happy accident of doing our jobs,\" he added. The Washington Free Beacon, a conservative website, republished \"the cartoons that jihadist fanatics don't want you to see\" as a salute to Charlie Hebdo. The author of that piece, Lachlan Markay, said the images were a \"good way of honoring the slain satirists by ensuring that people see the work for which they literally gave their lives.\" \"We didn't hesitate at all,\" Markay told CNNMoney. \"Our decision seems even more appropriate (and necessary) in light of decisions by some major news organizations to censor or omit images of Charlie Hebdo covers in their writeups. I think those outlets are doing a grave disservice to the very idea of free expression.\" This issue was brought to the forefront in 2005 after the Danish newspaper Jyllands-Posten ran several caricatures of the prophet. Those cartoons sparked violent protests, and many outlets opted against republishing them. The irreverent animated comedy \"South Park\" waded into that particular controversy in 2006 with an episode that censored an image of Mohammed. The show's creators Matt Stone and Trey Parker tried to show Mohammed once again in 2010, but were once again denied by Comedy Central.","title":"Charlie Hebdo terror attack: Tough decisions for news outlets","url":"http://money.cnn.com/2015/01/07/media/charlie-hebdo-terror-attack-media-mohammed-cartoons/index.html?iid=HP_LN","image_url":"http://i2.cdn.turner.com/money/dam/assets/150107160549-charlie-hebdo-620xa.png"}]