{"totalResults":40340,"results":[{"_id":"550931dd4277df4a92412856","body":"I get to run around the yard and sniff things","pubdate":"2015-03-24T11:15:25.417Z","title":"I get to run around the yard and sniff things","url":"http://lolaminute.com/i-get-to-run-around-the-yard-and-sniff-things/","image_url":"http://lolaminute.com/wp-content/uploads/2013/10/00_1044408_554135681309189_1254148219_n1.jpg"},{"_id":"550931dd4277df4a92412859","body":"Politics can be so discouraging that at times it actually seems more rational to vote an animal into office than an actual person. Over the course of history, there actually have been animals that have run for various political offices (and sometimes even won). Here are ten of the most notable animal politicians of the bunch: On September 13, 1938, Boston Curtis became the new Republican precinct committeeman for the town of Milton, Washington. Most remarkably, Curtis achieved this despite the fact that he was a brown mule. As it turned out, the whole stunt had been arranged by Democrat Milton Mayor Kenneth Simmons, who wanted to make Republicans look foolish and show that the average voter had no idea who he was supporting. Mayor Clay Henrys affinity for beer greatly worried the people of Lajitas, Texasmainly because Henry was a goat. From 1986 until his death in 1992, Clay Henry served his constituents well. Since then his son, Clay Henry Jr., has filled the position. If youre wondering how this scenario can actually exist, its because Lajitas is an unincorporated community where the position of mayor is merely symbolic. In fact, all these mayors had to worry about while in office was attracting tourists who would come and offer them beers. In his prime, Mayor Clay Henry Sr. was known to chug over 35 beers a day. Although we lack strong historical evidence to back up his story, Incitatus deserves a mention on this list. As Caligulas favored horse, Incitatus lived a life that most would deem a bit too opulent: Suetonius wrote that the horse lived in a marble stable and wore a collar made out of precious stones, while Dio Cassius mentioned Incitatus being fed oats mixed with gold flakes. However, the most outlandish claim of them all was that Caligula planned to make Incitatus a Roman consul before being assassinated. The only source we have for this is Suetonius, who lived almost 100 years after Caligula, so its likely false. Regardless, debates about this legendary horse still take place today. If youre looking for a true underdog story, look no further than Saucisse, the French dachshund. He started life as a garbage-dwelling stray before being rescued and adopted by a French writer named Serge Scotto. Scotto called his new pet Saucisse (sausage), and started using him as a character in his novels. This brought the dog a fair amount of fameso much so that he finished 6th (with 4.5 percent of votes) when he ran for mayor of Marseille in 2001. In 2009 he appeared in Secret Story, the French version of Big Brother. An ideal political leader is someone who tackles problems head-on. In theory, this means that a rhino would be perfect for the job. At least, thats what the people of Sao Paulo thought in 1958 when they voted for a rhino named Cacareco to become a member of city council. Unlike most other entries featured here, this was not a jokevoters did so to protest the rampant corruption of the Brazilian government at the time.","pubdate":"2015-03-24T11:15:25.527Z","title":"10 Animals That Actually Held Political Office","url":"http://all-that-is-interesting.com/10-animals-that-actually-held-political-office","image_url":"http://all-that-is-interesting.com/wordpress/wp-content/uploads/2015/02/office-curtis.jpg"},{"_id":"550931e74277df4a92412877","body":"Each day I see more and more chronically unproductive, unsuccessful and unhappy people and wonder why they choose to be miserable when they can take a few actions to become more successful. You will never know the true joy of happiness and success if you dont admit that you chose the wrong path in life. There are many successful people who consider themselves unhappy and unsuccessful because they are not grateful for what they already have and they are stuck in their own negative thoughts, which prevent them from reaching their full potential. Stop living in misery, here are 8 important actions you can take today that will make you more successful. Successful people always do what they love and this actually makes them so happy and successful. Spending 8 (or more) hours at work you dont like is one of the worst things you can do in life. When you love your job, you are more productive and eager to reach success. Never stop looking for your favorite job and you will definitely find it. Just dont tell me that you are not creative. I believe every person in the world is creative, but the problem is that most of us dont explore and cultivate that creativity. If you have any creative ideas, share them with your coworkers or boss. Even if they dont love your ideas, dont give up. Learn how to think outside the box, cultivate your creativity daily, train your brain and be open to new ideas. Its one of the most important actions that will make you more successful. Multitasking is a common thing these days. Whether its good or bad, but it will get you nowhere. Trying to reach a few goals or accomplishing a few tasks at once will never make you successful. You will end up feeling overwhelmed, exhausted, and stressed out. When you have a huge to-do list, take a deep breath to calm down (when I see a long list of tasks I should accomplish, the first thing I usually feel is panic), prioritize your tasks and focus on accomplishing one task at a time. This will help you stay productive, avoid stress and meet all your deadlines. No matter what you do, believe in yourself. If you made a mistake, admit it, learn from it and move on. Dont dwell on your past mistakes. Believe that you will be successful, happy and healthy. Believe that you can make your dreams come true. Faith is a crucial part of life, remember it. Read also 8 Worst Habits of Unhappy People and How to Break Them Theres a huge difference between negative criticism and constructive criticism. When you see that people give negative and rude criticism that has no sense at all, ignore it. We cant avoid toxic people in the workplace, but we can ignore their rude comments. Dont let peoples negative criticism affect your mood, productivity and success. The majority of people stop learning once they graduate from college or university. Highly successful people never stop learning, no matter the age. You may know a lot of useful things and have fantastic abilities, but they wont make you more successful. Dont be afraid to try new things and take new responsibilities. Read books and share your knowledge with others. If you dont have fantastic computer skills, let your potential employer know about it. If you cant accomplish a project, let your manager or boss know about it. Be honest and ask for help when you really need it. Its impossible to know everything in life, so its okay when someone helps you. Successful people cant do many things, they admit it and their honesty help them reach the true joy of success. Read also 8 Reasons Why Lying Is a Bad Idea Wealth is nothing without health. When you have numerous health issues, its hard to enjoy your success. You should never forget to take care of your health. Eat healthy, exercise regularly, get enough sleep and stay hydrated to be more productive and have more energy to accomplish any project and achieve any goal. I hope these tiny pieces of advice inspired you to take some actions to improve your life and reach the true joy of success. Stay motivated and productive during the day, learn and try new things, believe in yourself and you will never feel unhappy again. What actions are you going to take to become more successful?","pubdate":"2015-03-24T11:15:25.666Z","title":"8 Important Actions That Will Make You More Successful –","url":"http://career.amerikanki.com/actions-make-successful/","image_url":"http://career.amerikanki.com/wp-content/uploads/2015/02/Important-Actions-That-Will-Make-You-More-Successful.jpg","face_coordinates":{"y":70,"x":134,"w":77,"h":77}},{"_id":"550931e74277df4a92412878","body":"Net neutrality is a hot topic on everyones lips lately, and thats because it really matters. Imagine an internet where the service providers can block certain websites, then charge you to gain access to them at any time and for any reason. Doesnt sound so great, does it? Luckily, the FCC ruled in late February 2015 to classify the internet as a Title II service. But that doesnt mean were out of the woods yet Congress and ISPs can still try to strike down the ruling and take legal action against net neutrality. Heres hoping that doesnt happen.","pubdate":"2015-03-24T11:15:25.771Z","title":"Net Neutrality Explained In This Perfect Infographic","url":"http://all-that-is-interesting.com/net-neutrality-infographic","image_url":"http://all-that-is-interesting.com/wordpress/wp-content/uploads/2015/03/net-neutrality-infographic.jpg","face_coordinates":{"y":1920,"x":738,"w":143,"h":143}},{"_id":"550931e74277df4a92412879","pubdate":"2015-03-24T11:15:25.979Z","url":"http://howtospendit.ft.com/interior-design/79041-18th-century-chimneypieces","body":"New and unconventional takes on safari imbue the look with debonair verve, says Tom Stubbs","title":"18th-century chimneypieces","image_url":"http://assets1.howtospendit.ft-static.com/images/75/87/b7/7587b760-a7a8-4f5a-84ca-555efae4963c_one_forty_square_thumb.jpg"},{"_id":"550931e74277df4a9241287a","body":"Looking for an instant way to lose leg fat? Let me offer you some tips. When your legs arent the shape that you want them, they can severely limit the kind of wardrobe that you are able to consider. Moreover, you may feel and look less confident. If youd love to get your legs in great shape as quickly as possible, try out some of these tips. While running is an excellent way to lose leg fat, it tends to be too demanding for many people. If you find the strain involved to be too much, jogging or simply walking a couple of miles each day can help you burn calories and build lean, strong legs. If you want to get a super quick result, walk or run twice a day: in the morning and in the evening.","pubdate":"2015-03-24T11:15:26.117Z","title":"10 Effective Ways to Lose Leg Fat Fast –","url":"http://diet.amerikanki.com/ways-lose-leg-fat-fast/","image_url":"http://cdn6.amerikanki.com/wp-content/uploads/2014/10/Effective-Ways-to-Lose-Leg-Fat-Fast-500x347.jpg","face_coordinates":{"y":15,"x":222,"w":50,"h":50}},{"_id":"550931e84277df4a9241287b","body":"In spite of its infrastructure, landmarks and cultural significance, the city is not immortal. Detroit is no exception. While rebounding in some areas, for the most part 21st century Detroit remains a mere shadow of its former self. Once known for powering most of the country, Detroit lost its steam and 70% of its population in the last 60 years and had to declare bankruptcy in 2013 to stay afloat. A testament to globalizations impacts, its hard to imagine that this overwhelming mass of abandoned buildings and mpty streets was once considered the Silicon Valley of America. But for now, forget about the slums, high crime rates and urban graveyards, and think back to the days when Detroit symbolized the indomitable power of American industry and labor.","pubdate":"2015-03-24T11:15:26.271Z","title":"These Pictures Of Vintage Detroit Will Surprise You","url":"http://all-that-is-interesting.com/vintage-detroit","image_url":"http://all-that-is-interesting.com/wordpress/wp-content/uploads/2015/02/vintage-detroit-pinagree-park.jpg","face_coordinates":{"y":273,"x":473,"w":29,"h":29}},{"_id":"550931e84277df4a9241287c","body":"Love him or hate him and a lot of people sure do seem to hate him Kanye West is one of the hottest self-made, 21st century entrepreneurs. Hes risen from middle-class roots in Chicago to the top of the music industry, and then gone on to successfully leverage his fame to make big profits with business after business. The performers net worth before he was married was estimated to be $130 million, and its only grown since. He mostly made his money in the music game, first producing and then releasing records of his own. To date, West has stacked up 12 platinum records and sold about 20 million records in addition to his tour dates, investments, and other ventures. While most of his business deals seem to work out, Yeezie does have a few flops. One of the most prominent is his unsuccessful plan to bring Californias Fatburger chain to the Windy City. Chicago didnt care for the burgers, and Wests planned franchise expansion into 10 locations never made it past the first three. All of the Chicago Fatburger locations are now shuttered, and Kanye lost cash on the failed venture. Clearly though, Kanyes biggest enemy isnt his business sense, its his ego. Hes inspired eye-rolls and grumbles after interrupting the Grammy awards, not once but twice, in order to let the world know how much he loves Beyonce. That sort of self-confidence is great for branding when youre young, but will people be so forgiving as the star ages and loses touch with whats hot? Fortunately, thats not likely to happen. Kanye wisely chose to keep himself grounded by marrying Kim Kardashian, a woman who is famous for nothing if not being calm and stable. Kanyes oversized ego might make the rest of the world cringe, but its right at home in the Kardashian family. Kanye and Kims lavish $12 million Paris-to-Florence destination wedding had everything you could possibly imagine and more. Kanyes nothing if not a shrewd businessman and a good judge of character so the prenup leaves Kim with $1 million for every year that she can tolerate being married to a man who is essentially a walking infomercial for himself. Since their marriage, KimYe have combined their fortunes for a total net worth of at least $155 million, depending on which report you read. The power couple is continuing to keep the media buzzing about them at any cost, showing up for gossipy guest appearances on Kris Jenners talk show and bringing their baby North to outdoor photoshoots at New Yorks frigid fashion week. Speaking of fashion week, Kanyes latest venture includes a clothing line and a personalized pair of $350 Adidas trainers. Yeezys attempt at haute couture was widely panned as a flop by none other than acid-tongued Anna Wintour. The shoes were so popular, though, that they took a cue from their namesake and sold out as soon as they possibly could. Adidas is poised to make millions on the deal, burning through their initial supply of 9,000 pairs over the course of a weekend. If this latest business move is any indication, the world is going to be seeing a lot of Kanye West for a very long time. Lucky us.","pubdate":"2015-03-09T00:00:00.000Z","title":"Kanye West Net Worth: Adidas Yeezy Deal Adds to $155 Million Fortune | My First Class Life","url":"http://myfirstclasslife.com/kanye-west-net-worth-adidas-yeezy-deal-adds-155-million-fortune/","image_url":"http://myfirstclasslife.com/wp-content/uploads/2015/02/kayne.jpg"},{"_id":"550931eb4277df4a92412884","body":"Living in Dubai is a good guarantee that you will never be bored. The United Arab Emirates are overflowing with expensive cars, beautiful architecture and golden Nokias. Calling Dubai a luxurious place is a severe understatement. Weve all heard a few stories, but what does this constantly growing state truly have to offer to those that have no clue what Dubai is about. Lets take a closer look at the beautiful, multicultural city and talk about some of the amazing things you can do. It would be crazy to talk about Dubai attractions and leave out the Burj Khalifa. Not only does this 2,722-foot skyscraper hold the title of being the tallest building in the world, it also holds over a dozen other records. These includes having the worlds highest restaurant, as well as the worlds highest observation deck. Achieving so much with a single building sounds like an impossibly expensive task. Well, it is. The Burj Khalifa took roughly $1.5 billion to build, and spending a few nights in this giant will guarantee you several nights of insane luxury, comfort and entertainment that will not be soon forgotten. Although the beautiful architectural feat has over 160 floors, the high-speed elevator makes sure that youll reach your destination within seconds. You might want to hold onto something during your first trip, though. If theres one sport Dubai resident love, its golf. Several local golf courses have been designed by golf big shots like Tiger Woods, Ernie Els and Colin Montgomery. Their influence will ensure that every hole you play will be worth your while. To make your stay even better, its quite likely that youll bump into a few celebrities that often visit the courses to boot. Every year, Dubais Emirates Golf Club holds a huge competition with $2.5 million in prize money. Its called the Dubai Desert Classic, and if youre a golf lover and present at the right time of the year, youll be in for an exciting experience. The Dubai Creek Golf and Yacht Club has amazing golf courses as well. Located in the center of Dubai, the golf club gets thousands of visitors a year trying to beat previous records or simply golfing for fun. Visiting any of these golf courses will be sure to give even veteran golfers an enjoyable time filled with many exciting challenges. With the Burj Al Arab being called the worlds only 7 star hotel, this luxury lodge seems to have no intention of curbing our expectations. While it is the third tallest hotel in the world, this widely celebrated landmark has only 28 floors. No space is wasted, though every single one of the 202 suites is big and luxurious enough to house royalty. Speaking of royalty the Burjs Royal Suite wont be something youd likely want to sleep in. Dont get me wrong, the suite is absolutely divine (understatement), but with a $20,000/night price tag youll be hard-pressed to find a good nights rest. While spending the night here is too expensive for us common folk, you could take a peek inside by reserving a few spots at one of Burj Al Arabs equally luxurious restaurants, which will set you back a lot less. At a height of 1056 feet, the Burj Al Arab is a marvelous vista to admire, and offers an even better view at its upper floors. Its architect, Tom Wright from WKK Architects, has given the hotel an interesting form. It heavily resembles a ship sail, which blends perfectly with the underlying land, resulting in a stunning image. Definitely a place to visit if you can afford it. Another one of Dubais jewels is the Palm Jumeira a beautiful man-made island that is shaped exactly like a palm tree. Youll find this self-proclaimed world wonder on the coast of Jumeirah. It used to be only a pile of sand, and to be honest, it looked pretty amazing back then as well. Now its filled with resorts, hotels and overflowing with flora and fauna, making it something you must see for yourself, you can be sure that itll be something you never forget. This artificial island has transformed itself from nothing into its current state within the span of a mere 8 years. By the time Palm Jumeira was finished, it had already been the worlds largest man-made island for over a year. Traversing from the mainlands to Palm Juneira has been made easy through their speedy monorail that will make the 3.4-mile trip a breeze. There are two other Palm Islands in Dubai that are definitely worth looking into, but if you could pick only one, Id recommend going with the original Palm Island. Putting on your ski while youre surrounded by hot sand sounds silly. But this indoor ski resort makes it possible. Ski resorts arent that special, you might think, but this is Dubai were talking about. Located within the Mall of the Emirates, youll be able to race down 5 different slopes from a 60-meter high mountain. You might want to watch where youre going, though. Humans arent the only ones that love Ski Dubai. Multiple penguins live in this chilly artificial resort. If you book a few tickets before its sold out, you will be able to actually play with them as well. If ridiculously cute animals arent exactly your thing, you might want to take a look at the Snow Park right next to the slopes. It has several exciting attractions. If youre into sleds, slides and gigantic snowballs, this park will certainly be right up your alley. Being in Dubai immediately gives you the ability to take a trip around the world. This is true in both a literal and figurative sense. The World, another artificial island, but made in a shape that might be even more interesting than the aforementioned palm tree. This man-made archipelago mimics the map of the world, with 5.6 miles in length and 3.7 miles in width, its safe to say that The World is pretty big. Tourists can take a boat around this amazing engineering feat and gaze upon its beauty. With over 300 constructed islands, you might wonder who has set such a crazy task in motion. Well, thats Dubais leader, Sheikh Mohammed bin Rashid Al Maktoum himself. It took several years, but despite several delays The World has become a great example of what people are capable of. Apparently all we need is an exorbitant amount of money... Shoppers with incredibly high standards will absolutely love the Dubai Mall. With more than 1,200 shops to go through, youre sure to never run out of places to look for a bargain. Although the shops are only part of what the largest shopping center in the world has to offer. Millions of people visit the Dubai Mall every year to haggle for valuables at the Dubai Gold Souk, witness its indoor waterfall and to see its humongous aquarium in the flesh. The Dubai Mall is also right next to the Dubai fountains, which is a beautiful sight to see if youre at the right place at the right time. The Dubai Mall is a great place to visit with your family, and its often visited by celebrities from all over the world. Although, if youve visited several other malls that are almost on the same level, then the Dubai Mall wont blow your mind. If you havent, youll be amazed. Dubai is a state in which the use of alcohol is only allowed when youre at home or in your hotel. But with the vast amount of hotels sprinkled throughout the land, this hardly is a problem for many people. In fact, itll be hard to find a hotel in Dubai that doesnt have a single place serving alcohol. Should you stumble on a hotel that doesnt have a single restaurant, bar or club, then youre in the wrong place. On Friday, several eateries will add champagne brunches to their menus. For first-timers, its hard to imagine what to expect from this. If you were thinking in the direction of being served crazy amounts of delicious buffets accompanied with an insane amount of alcohol, then youre thinking in the right direction. Although its hard to imagine there being a real need for it, there are several hotels that offer all-you-can-eat champagne brunches. Champagne brunches are heaven on Earth for those with more developed palates. Its hard to believe that Dubai used to be a big heap of sand and that it has molded itself into one of the most desired tourist destinations in the entire world, and all within just two decades. To wrap it up, Dubai is filled with insane feats, and the residents are consistently besting each other with one feat before being defeated by another. This extravagant sense of rivalry between millionaires and billionaires has made Dubai into the crazy and exciting place it is now.","pubdate":"2015-03-09T00:00:00.000Z","title":"Dubai: The Sheikh Rat Race Making it the World’s Richest Playground for Architects | My First Class Life","url":"http://myfirstclasslife.com/dubai-the-sheikh-rat-race-making-it-the-worlds-richest-playground-for-architects/","image_url":"http://myfirstclasslife.com/wp-content/uploads/2015/02/Dubai.jpg","face_coordinates":{"y":1547,"x":366,"w":134,"h":134}},{"_id":"550931f74277df4a92412896","body":"Welcome to the newest edition of The Why. Why is being thin not necessarily healthy? Good question. (Besides, it beats answering the question: Why do guys even sleep with fat girls? Seriously? Any port in a storm isnt just an album title. Plus, lets not forget how we all have to be oh so PC and remind everyone not to judge a book by its cover even if a lady is the physical equivalent of an unabridged hard copy of Tolstoys War and Peace thats been soaked overnight in a full bathtub and then sun-dried, mmmkay?) For quite some time now, weve been told by doctors we need to watch our Body Mass Index, or BMI. We should be height-weight proportionate or something like that. According to last years study by the U.S. Centers for Disease Control and Prevention recently published in the Journal of the American Medical Association, 34.9 percent of us are obese and another third are overweight. So if this is true, then why is being thin not necessarily healthy? Lets check in with our friend from ABC News, Gillian Mohney. Mohney says that a lot of health experts have for some time thought BMI doesnt account for people who look svelte but have fat hidden away, making them normal weight obese. Those folks can still be storing fat that could result in serious health consequences just like folks whose BMI indicates theyre overweight. In fact, a 2010 study published in the European Heart Journal notes that approximately 30 million Americans could have this normal weight obesity. Carol Garber, a professor of Movement Science at the Teacher College at Columbia University, told ABC News: Its absolutely true there are some people who seem like no matter what theyre doing, they look really good but looks can be deceiving,. Even thin people could be at risk for heart disease. She added: We would regularly see people who had heart attacks come to (our) rehab program and look perfectly fine. (But) if you measured their body fat, they had a greater proportion of fat than they would have thought. (See? You cant judge a book by its cover.) Mohney confirms that experts note it is clear that apparent thinness (alone) does not always equal health and that even a skinny person with a low BMI can be unhealthy if fat has built up around their organs. Why is being thin not necessarily healthy? Now you know. You ask the questions. We provide the answers.","pubdate":"2015-03-24T11:15:27.644Z","title":"Why Is Being Thin Not Necessarily Healthy? — ‘The Why’","url":"http://americanlivewire.com/2015-03-17-why-is-being-thin-not-necessarily-healthy-the-why/","image_url":"http://americanlivewire.com/wp-content/uploads/nwo1-596x330.gif"},{"_id":"550931f74277df4a92412898","body":"People born in March are said to have some unique qualities that separate them from the rest of the people. They have unique talents, they make good partners and they can get the most out of any situation. They strive to be successful and they are not afraid to face challenges and solve problems. Check out some of the best traits of people born in March. People born in March are highly intuitive and its practically impossible to deceive them. They sense any diabolical scheme against them instantly, therefore, they can make a really strong enemy. If youre born in March, cultivate your intuition on a daily basis to have great powers of it. People born in the month of March are blessed with wonderful qualities such as generosity and sympathy. Their generosity helps them win the admiration and love of other people that encourage them to continue in their disinterested acts. People born in March enjoy volunteering; they are always ready to help those in need. The March born people can rarely, if ever, cheat on their loved ones. They are very devoted partners and they stick to their lover during the toughest of times. They try to avoid people who think that unfaithfulness is not the end of the world. They stick to their own principles and let their partners know what they want in a relationship. People born in March prefer to escape from the hustle and bustle of daily life and can often be found in a quiet place lost in their own thoughts. They stay away from garish and loud people and would choose serenity and peace over fame and wealth any day. Sure, not all of people born in March are shy and introverts, but the majority of them. Read also 10 Most Common Myths about Introverts People born during March are very good philosophers. They can spend a sufficient part of the day thinking over the difficulties and happiness of their lives and many other things. This quality helps them find true happiness in life and enjoy their lives to the fullest. The only problem is that they tend to dwell on the past mistakes and events and they are huge overthinkers. When you know how to cope with your thoughts and emotions, its great to be a philosopher. Everyone has talents, its a proven fact. The March born people are highly talented and they usually have an artistic bent of mind. They love music and fine arts. Its not surprising that many famous artists have their birthdays in March. What talents do you have? These people are extremely cheerful and they have verve for life. Their enthusiasm can rub off on people around them, and they spread happiness wherever they go. They never lose heart and keep smiling even in the toughest situations. I think most of us should adopt this trait from people born in the month of March. Valleys or deserts, mountains or plains, cold or hot people born in March can adapt to any terrain and situation. Give these people the basic needs of life and they will definitely survive. The ability to adapt to almost any situation is one of the strongest traits of people born in March. Read also 8 Traits of People Born in February If you are lucky to have your birthday in March, embrace yourself and celebrate your life. You are a really unique person; just dont stop growing and developing your personality. Sometimes we have amazing abilities but we dont see them because we dont explore them. What other qualities of people born in March can you name? Share your thoughts, please!","pubdate":"2015-03-24T11:15:27.808Z","title":"8 Wonderful Traits of People Born in March","url":"http://en.amerikanki.com/traits-people-born-march/","image_url":"http://cdn2.amerikanki.com/wp-content/uploads/2013/03/Traits_of_People_Born_in_March-500x333.jpg","face_coordinates":{"y":59,"x":204,"w":100,"h":100}},{"_id":"550931fc4277df4a9241289e","body":"4 Questions You Need To Ask When Making a Life Changing Decision 4 Questions You Need To Ask When Making a Life Changing Decision Making a life changing decision can be hard. It can result to sleepless nights, lack of focus and stress. Major decisions shouldnt be taken lightly. Its better to think about it a thousand times than regret it in the end. Yes, you have to put in the extra effort to analyze and ponder about everything. But sometimes its just hard how to tackle the issue. Decision making might not be easy especially if its a life changing one. But there are helpful pointers that can help you make the right decision. Here are four questions you need to ask yourself to help you. If you base your decisions based on your personal values, the less youll feel guilty or resentful about it in the end. And the more youll be happy. The values we keep make the person that we are. Theres no point in making a decision that will contradict your values. That will only make your life hard and miserable. Listen to your gut. Sometimes fear signals youre going out of your comfort zone which may be good, depending on the situation. Assess the feelings you have towards your decision. Are you afraid because this is something youve never done before? Beyond those fear, do you feel excited? Or are you afraid because you know that what youre about to do is wrong? Do you feel guilty? Your answer to these questions will help you make up your mind. If its hard to make a decision at the moment, try focusing your thoughts in the future. How do you see yourself 10-15 years from now? Do you think youll regret it if you dont push through with your decision now? Or will it be the other way around? No matter life choices we make, its inevitable that one time or another people might get hurt. But, will your decision make it worth it? Will you be a better person because of this decision? As much as we dont want other people to get hurt, we also dont want to live our lives trying to please them. At the same time, we shouldnt ignore their feelings. Gauge the consequences. Will your decision benefit everyone in the long run? You might be having a hard time now, but realize that this is all part of the process to grow as a person. Youre facing a major decision now and soon whatever you decide will make you more mature. The key is to make it a point that you drive your life. Instead of aimlessly going with the flow. Your decisions are you. Stand by them. Be firm about them and be responsible for whatever consequences. Life is about the journey and how you make it worth while. What major decision have you made in the past? How did it shape your life? Share on the comments below!","pubdate":"2015-03-24T11:15:27.953Z","title":"4 Questions You Need To Ask When Making a Life Changing Decision","url":"http://goweloveit.info/general/4-questions-you-need-to-ask-when-making-a-life-changing-decision/","image_url":"http://goweloveit.s3.amazonaws.com/wp-content/uploads/2015/03/4-Questions-You-Need-To-Ask-When-Making-a-Life-Changing-Decision.jpg"},{"_id":"550931fc4277df4a924128a4","body":"You need to be strong to live happily in this hectic world, but what should you do if you are not mentally strong and you cant cope with hard times in a proper way? First of all, you should learn how to become strong in spirit and handle lifes challenges quicker and with less struggle and stress. While many people are trying to become physically or intellectually strong, you can go ahead and develop your inner strength. Here are the most important steps to take in order to become strong in spirit in a week. Its not easy to overcome fears. If you feel like your fears start controlling your life and they make you weaker, dont wait until they ruin your life, take action. Sure, you cant overcome every fear you have in a week, but fight at least one big fear and you will instantly feel stronger in spirit. Faith has a huge power. When you believe in yourself, you are more confident and successful. Its easier to say, I will never do it, or They are stronger than I am, so Id better give up now. Never ever say it again. One of the best ways to become strong in spirit in a week is to repeat each day that you believe in your inner strength and your are strong enough to cope with any problem. Say it each morning and mean it. Read also 10 Things to Remind Yourself of Every Morning to Have a Happier Day Every time I face tough challenges, I remember the wise words from Kelly Clarksons song, What doesnt kill you makes you stronger... Really, hard times dont kill you, but they teach you how to be strong enough to cope with any lifes challenge. Dont be afraid of problems and mistakes. If you have any problem that you couldnt solve, fix it this week. You will feel more empowered, become more confident and strong in spirit. We tend to wait until something happens and only then we start taking action. This week, develop a habit of taking action on the most important things in your life. If you want to get a promotion, consider what you should do to reach this goal. Well, you have a good plan but you dont believe that you can move your career forward. Stop doubting and repeat after me, Im smart and strong enough to get that promotion. Say it out loud every time you doubt your abilities. I dont mean to stop saving for retirement or any big purchase. I do mean that you stop worrying about things that could happen in future. You dont know what will happen tomorrow so theres no need in worrying about it. The same goes for the past. Dont dwell on the past events. You cant change them, no matter how hard you try. Focus on the things happening today and dont let your past mistakes break your spirit. People who always inspire and motivate you to become stronger and happier are you best friends. This week try to pay close attention to people you spend more time with. If you notice that someone is dragging you down instead of bringing you up, say goodbye to them. You will feel much stronger in spirit once you let go of toxic people in your life. The urge to control everything in life can slowly break your spirit. Whether you want it or not, you cant control everything that happens to you in life. If you know that you cant change the situation, let it be. But make sure you really cant do anything about the situation. Moreover, dont try to control people around you. It will tire you out and can ruin your relationships. Let go of control this week and you will see significant changes in your life. Plus, you will know that you are strong enough to let go of control and live a free life. Last but not least way to become strong in spirit is to let go of anger. Learn how to respect your enemies and people you dislike. Just because they are trying to hurt your feelings doesnt mean you should do the same. Be smarter and be stronger than they are. Fill your heart with love instead of anger. Its quite possible to become strong in spirit in a week. Believe in yourself, in your abilities and in your inner strength. Remember, when you dont believe in yourself, no one believes in you. Follow the aforementioned tips and start taking action right now.","pubdate":"2015-03-24T11:15:28.119Z","title":"8 Instant Ways to Become Strong in Spirit in a Week","url":"http://en.amerikanki.com/ways-become-strong-spirit/","image_url":"http://cdn2.amerikanki.com/wp-content/uploads/2015/03/Ways-to-Become-Strong-in-Spirit-in-a-Week-500x333.jpg"},{"_id":"550931fc4277df4a924128a5","body":"The world affords some incredible places where people come to congregate in a beautiful setting with rich and vibrant nightlife. The following places are among the most popularly visited by party-seekers worldwide. If you are looking to experience world-class nightlife, be sure to check these places out! From the celebrated foam parties of clubs like Amnesia to the stunning island beaches, Ibiza has become a Mediterranean playground for party-goers from all corners of the earth. Cities like Ibiza Town and Sant Antoni boast a myriad of clubs, pubs, bars, and venues that entice anyone in the mood for eating, drinking, dancing, and mingling. While the island is most famous for its party scene, Ibiza also features various World Heritage Sites that are well worth visiting during the day.","pubdate":"2015-03-24T11:15:28.297Z","title":"10 World's Best Party Places","url":"http://travel.amerikanki.com/best-places-party-world/","image_url":"http://img.amerikanki.com/wp-content/uploads/2014/08/Worlds-Best-Party-Places-500x333.jpg"},{"_id":"550931fc4277df4a924128a6","body":"While a beautiful, perfectly planned wedding certainly does take considerable work, there are some parts that can require far more effort than others to get right. Arranging for great floral decor for your wedding venue is one of them. For most people, designing floral arrangements at a wedding isnt something they could learn to do on their own. They need help from a professional. If youre planning on bringing one in, you still need to know how to find someone whos right for your wedding. Here are ten tips to follow when choosing a wedding florist. Most florists are capable of creating beautiful flower arrangements for weddings. If youre looking for elaborate thematic arrangements, though, a floral designer may be a better idea. While these professionals are more expensive, they bring great artistic skill to the job.","pubdate":"2015-03-25T10:03:16.320Z","title":"10 Essential Tips for Choosing a Florist","url":"http://wedding.amerikanki.com/tips-choosing-wedding-florist/","image_url":"http://cdn10.amerikanki.com/wp-content/uploads/2014/09/Tips_for_Choosing_a_Wedding_Florist-500x332.jpg"},{"_id":"550931fc4277df4a924128a7","body":"The regular tented wedding table numbering design seen at weddings everywhere tends to be depressingly familiar to many wedding guests. Using an imaginative number design scheme doesnt have to be hard. All you need is to set a little time aside. Here are ten creative ways to display wedding table numbers that you may want to try. Paper filigree or quilling is the art of creating decorative shapes with special ribbons of paper. For your wedding table numbers, the ribbon will need to be stuck edgewise on the cardstock to be decorated. If you know someone who is good at this art form and is willing to help, you can have beautiful, old-fashioned numbers for your tables.","pubdate":"2015-03-25T10:03:16.492Z","title":"10 Creative Ways to Display Table Numbers","url":"http://wedding.amerikanki.com/ways-display-wedding-table-numbers/","image_url":"http://cdn10.amerikanki.com/wp-content/uploads/2014/09/Unique_Ways_to_Display_Wedding_Table_Numbers-500x333.jpg"},{"_id":"550931fc4277df4a924128a9","body":"As far as entertainment fans are concerned, a spicy celebrity feud is always fun. Some feuds, though, get so bad that the stars involved vow never to be caught on the same project ever again. Here are 10 of the most interesting such feuds in Hollywood. Twenty years ago, Julia Roberts and Nick Nolte did a romantic comedy together called I Love Trouble. While the movie was entirely forgettable, the stars didnt forget how much they hated each other through the movie. Reportedly, there was so much venom in the air that they had to shoot for most of their scenes separately. After the movie, Roberts called Nolte disgusting and Nolte called Roberts not nice. Understandably, they refuse to ever work together again.","pubdate":"2015-03-24T11:15:28.927Z","title":"10 Popular Celebrities Who Refuse to Work Together","url":"http://celebs.amerikanki.com/celebrities-refuse-work/","image_url":"http://celebs.amerikanki.com/wp-content/uploads/2014/09/Pierce_Brosnan_and_Teri_Hatcher-500x338.jpg"},{"_id":"550931fc4277df4a924128aa","pubdate":"2015-03-24T11:15:29.147Z","url":"http://howtospendit.ft.com/destinations/74801-see-the-best-of-qatar-on-a-short-city-break","body":"New and unconventional takes on safari imbue the look with debonair verve, says Tom Stubbs","title":"See the best of Qatar on a short city break","image_url":"http://assets4.howtospendit.ft-static.com/images/92/d6/9a/92d69a92-d567-44ec-aeb9-2755a12e14b4_one_forty_square_thumb.jpg"},{"_id":"550931fc4277df4a924128ae","body":"When you put unhealthy food into your body, you probably wont look and feel your best. Bad eating habits can cause acne, fatigue, mood swings, and lead to a number of serious diseases. If youre looking for a fresh start for your health, consider banishing all the junk from your pantry and following a clean diet. Here are ten things to know about eating clean: While there are a few wholesome offerings in the center of the supermarket, most aisles are full of preservative-laden chips, cookies and crackers. Avoid most of that packaged stuff and opt to shop along the stores outer edges instead. Using this tactic will be a great start in your quest to live the clean lifestyle.","pubdate":"2015-03-24T11:15:29.306Z","title":"10 Ways to Change Unhealthy Eating Habits –","url":"http://diet.amerikanki.com/change-unhealthy-eating-habits/","image_url":"http://cdn6.amerikanki.com/wp-content/uploads/2014/10/10-ways-to-change-unhealthy-eating-habits-500x353.jpg","face_coordinates":{"y":29,"x":213,"w":112,"h":112}},{"_id":"550931fc4277df4a924128af","body":"I am getting so many facebook messages related to NASAs Confirmation about december 6 days darkness due to solar strom.Some of the major news websites also published this.So I google it for the authentication.I found a facebook post published on October 30 from NASAs Earth Observatory page stating that NASA has in no way issued any statment regarding 3 (or 6) days or darkness in december. See the Screenshot of the facebook page message. So dont beleive any rumors and hoaxes.","pubdate":"2015-03-24T11:15:29.461Z","title":"Is 6 Days Darkness in December 2014 Real ?","url":"http://jbnote.com/6-days-darkness-december-2014-real/","image_url":"http://jbnote.com/wp-content/uploads/2014/12/nasa-darkness.png"}]}